# SplitOverlappingFacesFailed Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MassFailures..::..SplitOverlappingFacesFailed Property
BuiltInFailures..::..MassFailures Class See Also
---
Failed to resolve all overlaps between faces of the same Mass Energy Analytical Model.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SplitOverlappingFacesFailed { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SplitOverlappingFacesFailed As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SplitOverlappingFacesFailed {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MassFailures Class
Autodesk.Revit.DB Namespace